const SHEET_DATA = [
{ name1: "陸服", value1: 起, value2: 迄, note1: "新實裝人形", note2: "陪跑復刻", note3: "自選池", name2: "台服", value3: 起 , value4: 迄, note4: "新實裝人形", note5: "陪跑復刻", note6: "自選池"},																									
{ name1: "開服", value1: 231221, value2: --, note1: "常駐班底", note2: "", note3: "", name2: "開服", value3: 241205 , value4: --, note4: "常駐班底", note5: "", note6: ""},																									
"{ name1: ""異鄉樂徽"", value1: 231225, value2: 240123, note1: ""黛煙(物)"", note2: """", note3: """", name2: ""玻璃島的
駐行者"", value3: 241205 , value4: 241225, note4: ""索米(冰)/烏爾麗德(物)/
洛塔(冰)"", note5: """", note6: """"},"																									
"{ name1: ""方糖特調
沙龍籌備"", value1: 240123, value2: 240223, note1: ""桑朵莱希(火)"", note2: """", note3: """", name2: ""狂想四重奏"", value3: 241226 , value4: 250115, note4: ""瑪綺朵(冰)/波波沙(物)"", note5: """", note6: """"},"																									
"{ name1: ""交織突進"", value1: 240223, value2: 240326, note1: ""萊娜(電)"", note2: """", note3: """", name2: ""於灰敗的
羽翼中"", value3: 250116 , value4: 250205, note4: ""黛煙(物)"", note5: """", note6: """"},"																									
{ name1: "循跡追演", value1: 240326, value2: 240430, note1: "絳雨(電)", note2: "黛煙(物)", note3: "", name2: "駐足之地", value3: 250206 , value4: 250226, note4: "杜莎妮(冰)", note5: "", note6: ""},																									
{ name1: "狂想四重奏", value1: 240430, value2: 240605, note1: "瑪綺朵(冰)", note2: "桑朵莱希(火)", note3: "", name2: "方糖特調沙龍", value3: 250227 , value4: 250319, note4: "桑朵莱希(火)", note5: "索米(冰)", note6: ""},																									
"{ name1: ""玻璃島的
駐行者(上)"", value1: 240605, value2: 240625, note1: ""烏爾麗德(物)/洛塔(冰)"", note2: ""萊娜(電)"", note3: """", name2: ""遠日點(上)"", value3: 250320 , value4: 250409, note4: ""可露凱(毒)"", note5: ""瑪綺朵(冰)"", note6: """"},"																									
"{ name1: ""玻璃島的
駐行者(下)"", value1: 240625, value2: 240716, note1: ""索米(冰)"", note2: ""絳雨(電)"", note3: """", name2: ""遠日點(下)"", value3: 250410 , value4: 250430, note4: ""米什緹(毒)"", note5: ""黛煙(物)"", note6: """"},"																									
{ name1: "駐足之地", value1: 240716, value2: 240806, note1: "杜莎妮(冰)", note2: "瑪綺朵(冰)", note3: "", name2: "逃離賽博格", value3: 250501 , value4: 250521, note4: "維克托(火)", note5: "杜莎妮(冰)", note6: ""},																									
"{ name1: ""拂曉的迴響"", value1: 240806, value2: 240827, note1: ""朝暉(水)/波波沙(物)"", note2: ""烏爾麗德(物)"", note3: """", name2: ""心智洄游·
素銀匿信"", value3: 250522 , value4: 250611, note4: ""幼熙(物)"", note5: ""桑朵莱希(火)"", note6: """"},"																									
"{ name1: ""遠日點(上)"", value1: 240827, value2: 240919, note1: ""可露凱(毒)"", note2: ""索米(冰)"", note3: ""黛煙(物)/桑朵莱希(火)/
萊娜(電)/絳雨(電)/
瑪綺朵(冰)"", name2: ""拂曉的迴響"", value3: 250612 , value4: 250702, note4: ""朝暉(水)"", note5: ""可露凱(毒)"", note6: """"},"																									
"{ name1: ""遠日點(下)"", value1: 240919, value2: 241009, note1: ""米什緹(毒)"", note2: ""杜莎妮(冰)"", note3: """", name2: ""密米爾的
返演"", value3: 250703 , value4: 250723, note4: ""春田(水)/佩莉(火)/
緋(物)"", note5: ""米什緹(毒)"", note6: ""索米(冰)/烏爾麗德(物)/
瑪綺朵(冰)/黛煙(物)""},"																									
{ name1: "逃離賽博格", value1: 241009, value2: 241029, note1: "維克托(火)", note2: "朝暉(水)", note3: "", name2: "煙火重燃之時", value3: 250724 , value4: 250813, note4: "秋樺(火)", note5: "維克托(火)", note6: ""},																									
"{ name1: ""心智洄遊·
紀念日禮讚"", value1: 241029, value2: 241119, note1: ""比悠卡(電)"", note2: ""可露凱(毒)"", note3: """", name2: ""匿影而生"", value3: 250814 , value4: 250903, note4: ""妮基塔(水)"", note5: ""幼熙(物)"", note6: """"},"																									
"{ name1: ""心智洄遊·
共訴隱匿時"", value1: 241119, value2: 241210, note1: ""安朵絲(電)"", note2: ""米什緹(毒)/
絳雨(電)"", note3: """", name2: ""心智洄遊·
紀念日禮讚"", value3: 250904 , value4: 250924, note4: ""比悠卡(電)/安朵絲(電)"", note5: ""朝暉(水)"", note6: """"},"																									
"{ name1: ""密米爾的
返演(上)"", value1: 241210, value2: 241231, note1: ""春田(水)/緋(物)"", note2: ""維克托(火)/
瑪綺朵(冰)"", note3: ""烏爾麗德(物)/索米(冰)/
杜莎妮(冰)/朝暉(水)"", name2: ""心智洄遊·
共訴隱匿時"", value3: 250909 , value4: 250924, note4: """", note5: """", note6: """"},"																									
"{ name1: ""密米爾的
返演(下)"", value1: 241231, value2: 250121, note1: ""佩莉(火)"", note2: ""比悠卡(電)/
桑朵莱希(火)"", note3: """", name2: ""循跡追演"", value3: 250925 , value4: 251015, note4: ""絳雨(電)"", note5: ""春田(水)"", note6: """"},"																									
"{ name1: ""煙火迎春歸"", value1: 250121, value2: 250211, note1: ""秋樺(火)"", note2: ""安朵絲(電)/
米什緹(毒)"", note3: """", name2: ""心跳遊樂園"", value3: 251016 , value4: 251105, note4: ""芙洛倫(水)"", note5: ""秋樺(火)"", note6: """"},"																									
"{ name1: ""心智洄游·
素銀匿信"", value1: 250211, value2: 250304, note1: ""幼熙(物)"", note2: ""春田(水)/
黛煙(物)"", note3: """", name2: ""沉沒夜潮"", value3: 251106 , value4: 251126, note4: ""琳德(毒)"", note5: ""妮基塔(水)"", note6: """"},"																									
"{ name1: ""匿影而生"", value1: 250304, value2: 250325, note1: ""妮基塔(水)"", note2: ""佩莉(火)/
可露凱(毒)"", note3: """", name2: ""錯位錨定(上)"", value3: 251127 , value4: 251217, note4: ""萊婭(電)"", note5: ""安朵絲(電)/
米什緹(毒)"", note6: """"},"																									
"{ name1: ""錯位錨定(上)"", value1: 250325, value2: 250415, note1: ""萊婭(電)"", note2: ""秋樺(火)/
杜莎妮(冰)"", note3: ""萊娜(電)/維克托(火)/
比悠卡(電)/安朵絲(電)"", name2: ""交織突進"", value3:  , value4: , note4: ""萊娜(電)"", note5: """", note6: """"},"																									
"{ name1: ""錯位錨定(下)"", value1: 250415, value2: 250506, note1: ""洛貝拉(冰)"", note2: ""幼熙(物)/
索米(冰)"", note3: """", name2: ""錯位錨定(下)"", value3: 251218 , value4: 260107, note4: ""洛貝拉(冰)"", note5: ""比悠卡(電)/
絳雨(電)"", note6: """"},"																									
"{ name1: ""鏡繭與囚蝶"", value1: 250506, value2: 250527, note1: ""萊妮(物)"", note2: ""妮基塔(水)/
烏爾麗德(物)"", note3: """", name2: ""虛境新始"", value3: 260108 , value4: 260128, note4: ""路易士(火)"", note5: ""佩莉(火)/
芙洛倫(水)"", note6: """"},"																									
"{ name1: ""心跳遊樂園"", value1: 250527, value2: 250617, note1: ""芙洛倫(水)"", note2: ""萊婭(電)/
春田(水)/"", note3: """", name2: ""前進吧,
王牌配送員!"", value3: 260129 , value4: 260218, note4: ""櫻花(火)"", note5: ""琳德(毒)"", note6: """"},"																									
"{ name1: ""沉沒夜潮"", value1: 250617, value2: 250708, note1: ""琳德(毒)"", note2: ""洛貝拉(冰)/
米什緹(毒)"", note3: """", name2: ""鏡繭與囚蝶"", value3: 問飛鏢 , value4: , note4: ""萊妮(物)"", note5: """", note6: """"},"																									
"{ name1: ""火花之罪(上)"", value1: 250708, value2: 250729, note1: ""埃芙(冰)/巴希達(物)"", note2: ""萊妮(物)/
比悠卡(電)"", note3: ""瑪綺朵(冰)/可露凱(毒)/
春田(水)/秋樺(火)/
幼熙(物)/萊婭(電)"", name2: ""火花之罪(上)"", value3: 問飛鏢 , value4: , note4: ""埃芙(冰)/巴希達(物)"", note5: """", note6: """"},"																									
"{ name1: ""火花之罪(下)"", value1: 250729, value2: 250819, note1: ""威瑪西娜(物)"", note2: ""芙洛倫(水)/
安朵絲(電)"", note3: """", name2: ""火花之罪(下)"", value3: 問飛鏢 , value4: , note4: ""威瑪西娜(物)"", note5: """", note6: """"},"																									
"{ name1: ""虛境新始"", value1: 250909, value2: 250930, note1: ""劉易斯(火)"", note2: ""琳德(毒)/
佩莉(火)"", note3: """", name2: ""歧路雙軌(上)"", value3: 問飛鏢 , value4: , note4: ""海倫(冰)"", note5: """", note6: """"},"																									
"{ name1: ""歧路雙軌(上)"", value1: 250930, value2: 251021, note1: ""海倫(冰)"", note2: ""埃芙(冰)/
烏爾麗德(物)"", note3: ""杜莎妮(冰)/米什緹(毒)/
妮基塔(水)/萊婭(電)"", name2: ""歧路雙軌(下)"", value3: 問飛鏢 , value4: , note4: ""翡圖薩(毒)"", note5: """", note6: """"},"																									
"{ name1: ""歧路雙軌(下)"", value1: 251021, value2: 251111, note1: ""翡圖薩(毒)"", note2: ""威瑪西娜(物)/
秋樺(火)"", note3: """", name2: ""鑄碑者的
黎明(上)"", value3: 問飛鏢 , value4: , note4: ""羅蕾萊(火)/
哈卜茜(毒)"", note5: """", note6: """"},"																									
"{ name1: ""前進吧,
王牌配送員!"", value1: 251111, value2: 251202, note1: ""櫻花(火)"", note2: ""劉易斯(火)/
幼熙(物)"", note3: """", name2: ""鑄碑者的
黎明(上)"", value3: 問飛鏢 , value4: , note4: ""夏安(物)"", note5: """", note6: """"},"																									
"{ name1: ""鑄碑者的
黎明(上)"", value1: 251202, value2: 251223, note1: ""羅蕾萊(火)/
哈卜茜(毒)"", note2: ""海倫(冰)/
妮基塔(水)"", note3: ""瑪綺朵(冰)/可露凱(毒)/
春田(水)/索米(冰)/
維克托(火)/安朵絲(電)"", name2: ""信號波
重度依賴"", value3: 問飛鏢 , value4: , note4: ""貝絲蒂(毒)"", note5: """", note6: """"},"																									
"{ name1: ""鑄碑者的
黎明(上)"", value1: 251223, value2: 260113, note1: ""夏安(物)"", note2: ""翡圖薩(毒)/
萊婭(電)"", note3: """", name2: """", value3:  , value4: , note4: """", note5: """", note6: """"},"
"{ name1: ""信號波
重度依賴"", value1: 260113, value2: 260203, note1: ""貝絲蒂(毒)"", note2: ""櫻花(火)"", note3: """", name2: """", value3:  , value4: , note4: """", note5: """", note6: """"},"																									
];
add data structure
